<template>
  <section class="d-flex align-center justify-center">
    <!-- tabs -->
    <v-container class="pt-12">
      <v-card
        class="my-12 pointer-section py-sm-12 px-sm-12"
        min-height="280px"
        elevation="0"
      >
      <h1 style="text-align:center" class="mt-6">المنهجيات</h1>
    </v-card>

        <v-card
          class="manhag"
          style="overflow: visible"
          elevation="0"
        >
        <v-container class="pt-12">
            <v-section class="my-12">
            <v-row>
                <v-col lg="8">
                 <p>تحليل أسعار الإيجارات يُعَد مكونًا أساسيًا لفهم ديناميكيات سوق الإيجار، والذي له تأثيرات كبيرة على السياسات الاقتصادية، استراتيجيات الاستثمار، والقرارات المالية الفردية. من خلال المؤشر الإيجاري، يتم تقييم تأثيرات عدة عوامل مثل خصائص العقار، خصائص الوحدة، والموقع. المؤشر التفصيلي لأسعار الإيجارات في الحي الواحد يتأثر بعدة عوامل، منها خصائص العقار، خصائص الوحدة، الموقع، وغير ذلك. تم في تبويب المؤشر التفصيلي محاولة تغطية الفجوة السعرية في الحي الواحد من خلال حساب نطاقات سعرية شملت توزيع السعر الطبيعي للوحدات 
                    المتشابهة نسبيًا في الخصائص، مما يوفر رؤى قيمة حول اتجاهات السوق.</p>
                </v-col>
                <v-col lg="4">
                  <v-img src="../../src/assets/images/citizen.jpg" />
                </v-col>
            </v-row>
            <p>نطاقات الأسعار في المؤشر التفصيلي حسب توزيع 
                المئوي وهو مقياس إحصائي يُستخدم لوصف موقع قيمة معينة ضمن مجموعة بيانات. يُقسِّم التوزيع المئوي مجموعة البيانات إلى مائة جزء متساوٍ، حيث يشير كل جزء إلى النسبة المئوية للقيم التي تقع تحت أو تساوي قيمة معينة. على سبيل المثال، إذا كانت قيمة معينة تقع عند الجزء الـ 70، فهذا يعني أن 70% من القيم في مجموعة البيانات تكون أقل من أو تساوي تلك القيمة، بناء على ذلك تم حساب النطاقات السعرية كالتالي:نطاقات الأسعار في المؤشر التفصيلي حسب توزيع المئوي وهو مقياس إحصائي يُستخدم لوصف موقع قيمة معينة ضمن مجموعة بيانات. يُقسِّم التوزيع المئوي مجموعة البيانات إلى مائة جزء متساوٍ، حيث يشير كل جزء إلى النسبة المئوية للقيم التي تقع تحت أو تساوي قيمة معينة. على سبيل المثال، إذا كانت قيمة معينة تقع عند الجزء الـ 70، فهذا يعني أن 70% من القيم في مجموعة البيانات تكون أقل من أو تساوي تلك القيمة
                ، بناء على ذلك تم حساب النطاقات السعرية كالتالي:</p>

                <v-list>
                    <v-list-item>
                        <p>نطاق السعر المنخفض: حيث يقع توزيع السعر بين أقل 10 إلى 30 بيرسنتايل (Percentile 10 – 30).</p>
                    </v-list-item>
                    <v-list-item>
                        <p> نطاق السعر المتوسط: حيث يقع توزيع السعر بين أقل 10 إلى 30 بيرسنتايل (Percentile 10 – 30).</p>
                    </v-list-item>
                    <v-list-item>
                        <p>نطاق السعر المرتفع: حيث يقع توزيع السعر بين أقل 10 إلى 30 بيرسنتايل (Percentile 10 – 30)</p>
                    </v-list-item>
                </v-list>
        </v-section>
        <v-section>
           <v-container>
            <v-row>
                <v-col lg="4">
                   <v-img src="../../src/assets/images/citizen.jpg"/>
                </v-col>
                <v-col lg="8">
                    <p>تم حساب المؤشر الإيجاري العام للمملكة العربية السعودية والمؤشر العام للمدن الكبرى عبر تدريب نموذج الانحدار الخطي التضميني، المعروف عالميًا في التطبيقات العقارية لحساب مؤشرات أسعار العقارات. من خلال هذا النموذج، تمكنّا من حساب المؤشر العام باستخدام مؤشر فيشر، يقوم فيشر بدمج مؤشرات متعددة، ليوفر تقديرًا أدق وأكثر توازنًا للتغيرات في الأسعار على مر الزمن، مما يساعد في تقديم صورة واضحة وشاملة.</p>
                </v-col>
            </v-row>
            <p>اختيار مؤشر فيشر لأسعار العقارات يعود إلى قدرته على تقديم تقديرات دقيقة ومتوازنة لتغيرات الأسعار، بفضل دمجه بين مزايا مؤشري لاسبيرز وباشيه واستخدام المتوسط الجيومتري لتحقيق توازن مثالي. تقدم مؤشرات أسعار الإيجارات وفقًا لطريقة لاسبيرز وباش وجهات نظر مختلفة حول تغيرات أسعار الإيجارات، حيث يفضل مؤشر لاسبيرز فترة الأساس، ويفضل مؤشر باش الفترة الحالية. يجمع مؤشر أسعار الإيجارات فيشر بين المؤشرين من خلال حساب المتوسط الجيومتري لهما، للتخفيف من تحيزاتهما وتوفير مقياس أكثر دقة لتغيرات أسعار الإيجار.</p>
           </v-container>
        </v-section>
    </v-container>

        </v-card>
    </v-container>
  </section>
</template>

<script>
import {  defineComponent } from "vue";
// import { useI18n } from "vue-i18n";
// import { ar } from "date-fns/locale";

export default defineComponent({
//   name: "PointerView",

  //   setup() {};
});
</script>

<!-- <template>
    <section class="d-flex align-center justify-center pt-13">
        <v-container class="pt-12">
            <v-section class="my-12">
            <v-row>
                <v-col lg="8">
                 <p>تحليل أسعار الإيجارات يُعَد مكونًا أساسيًا لفهم ديناميكيات سوق الإيجار، والذي له تأثيرات كبيرة على السياسات الاقتصادية، استراتيجيات الاستثمار، والقرارات المالية الفردية. من خلال المؤشر الإيجاري، يتم تقييم تأثيرات عدة عوامل مثل خصائص العقار، خصائص الوحدة، والموقع. المؤشر التفصيلي لأسعار الإيجارات في الحي الواحد يتأثر بعدة عوامل، منها خصائص العقار، خصائص الوحدة، الموقع، وغير ذلك. تم في تبويب المؤشر التفصيلي محاولة تغطية الفجوة السعرية في الحي الواحد من خلال حساب نطاقات سعرية شملت توزيع السعر الطبيعي للوحدات 
                    المتشابهة نسبيًا في الخصائص، مما يوفر رؤى قيمة حول اتجاهات السوق.</p>
                </v-col>
                <v-col lg="4">
                  <v-img src="../../src/assets/images/citizen.jpg" />
                </v-col>
            </v-row>
            <p>نطاقات الأسعار في المؤشر التفصيلي حسب توزيع 
                المئوي وهو مقياس إحصائي يُستخدم لوصف موقع قيمة معينة ضمن مجموعة بيانات. يُقسِّم التوزيع المئوي مجموعة البيانات إلى مائة جزء متساوٍ، حيث يشير كل جزء إلى النسبة المئوية للقيم التي تقع تحت أو تساوي قيمة معينة. على سبيل المثال، إذا كانت قيمة معينة تقع عند الجزء الـ 70، فهذا يعني أن 70% من القيم في مجموعة البيانات تكون أقل من أو تساوي تلك القيمة، بناء على ذلك تم حساب النطاقات السعرية كالتالي:نطاقات الأسعار في المؤشر التفصيلي حسب توزيع المئوي وهو مقياس إحصائي يُستخدم لوصف موقع قيمة معينة ضمن مجموعة بيانات. يُقسِّم التوزيع المئوي مجموعة البيانات إلى مائة جزء متساوٍ، حيث يشير كل جزء إلى النسبة المئوية للقيم التي تقع تحت أو تساوي قيمة معينة. على سبيل المثال، إذا كانت قيمة معينة تقع عند الجزء الـ 70، فهذا يعني أن 70% من القيم في مجموعة البيانات تكون أقل من أو تساوي تلك القيمة
                ، بناء على ذلك تم حساب النطاقات السعرية كالتالي:</p>
        </v-section>
    </v-container>
    </section>
  </template>
  
  <script setup>
  //
  </script>
   -->
